import React, { Component } from "react";
import CommonA from "./Common-a-home";
import Global from "../../../Image/s2.jpg";
import Persevering from "../../../Image/kishwar-kaniz-shy-bride.jpg";
import Womenpoewr from "../../../Image/Women-Power.jpg";
import Social from "../../../Image/pppp.jpg";

export class Homexx extends Component {
  render() {
    return (
      <div>
        <div className="welcome">
          <ul>
            <li>
              <h1>धारणा</h1>
              <br />
              <p>
                हम महिला केंद्रित मुद्दों पर अपना ध्यान केंद्रित करेंगे, जितना
                संभव हो सके, अपने अधिकारों, विशेष रूप से सीमांत क्षेत्र में उन
                लोगों को पहचानने, उनकी रक्षा करने और उन्हें बढ़ावा देकर महिलाओं
                के साथ भेदभाव को समाप्त करने में मदद करेंगे। हम एक ऐसा वातावरण
                बनाने का इरादा रखते हैं, जो हमारे समाज की बुरी प्रथाओं के खिलाफ
                लड़ाई का नेतृत्व करे और यह बहुत ही अपना रवैया है, जो महिलाओं के
                यौन संबंधों या लिंग-आधारित नुकसानों और सीमाओं को ऑफसेट करने या
                संबोधित करने में विफल रहता है, जिसके परिणामस्वरूप महिलाओं को
                उनके अधिकारों की मान्यता और संरक्षण और अवसरों, लाभों और
                विशेषाधिकारों के आनंद के लिए उनकी पहुंच से वंचित या प्रतिबंधित
                किया जाता है। हम मौजूदा महामारी या किसी भी आगामी आपदा के दौरान
                महिलाओं की सुरक्षा और सुरक्षा के लिए आवाज उठाने के साथ-साथ लड़ने
                का संकल्प लेते हैं, आपदाओं और अन्य संकटों में विशेष रूप से राहत,
                वसूली, पुनर्वास सहित राज्य की समीक्षा और महिलाओं के लिए भेदभाव
                वाले मौजूदा कानूनों के खिलाफ विभाजन होगा। यह हमेशा हमारा
                उद्देश्य होगा कि हम अपने समाज के बीच सामंजस्य और समानता को
                बढ़ावा दें और व्यक्ति की भावनाओं की सही व्याख्या करें और हमारे
                समाज के सभी वर्गों के बीच विश्वास पैदा करें, लेकिन जब महिला
                केंद्रित प्रश्न राजनीतिक और सामाजिक चरित्र के हित में शामिल होते
                हैं किसी भी विवेकपूर्ण टिप्पणी और आलोचना के लिए हमारे कॉलम खुले
                रखें।
              </p>
            </li>
            <li>
              <div className="container"></div>
            </li>
          </ul>
        </div>
        <br />
        <br />
        <CommonA
          link1="/page"
          img1={Global}
          link1a="/page"
          head1="वैश्विक भूमिका "
          contant1="पूरे इतिहास में, समाज में महिलाओं की केंद्रीय भूमिका ने राष्ट्रों
                    की स्थिरता, प्रगति और दीर्घकालिक विकास सुनिश्चित किया है। विश्व
                    स्तर पर, महिलाओं में दुनिया की 43 प्रतिशत कृषि श्रम शक्ति शामिल है
                    - कुछ देशों में 70 प्रतिशत तक।"
          link2="/page"
          img2={Persevering}
          link2a="/page"
          head2="दृढ़ता से भारतीय महिलाओं"
          contant2="भारतीय महिलाएं न केवल देवत्व का अवतार हैं, क्योंकि हमारे समाज में
                महिलाओं को देवताओं के रूप में भी चित्रित किया गया है, लेकिन उनके
                कठोर स्वभाव के कारण और इसे दैनिक घरेलू कामों में धकेलने के लिए
                हमारी स्वीकृति है, यह एक ऐसा तथ्य है जिसे हमारे पारंपरिक से इनकार
                नहीं किया जा सकता समाज जो सोचता है कि ऐसे कार्य करना उनका कर्तव्य
                है।"
        />
        <CommonA
          link1="/page"
          img1={Womenpoewr}
          link1a="/page"
          head1="एक बार में दो कदम "
          contant1=" पूरे इतिहास में, हम सहयोग से एक साथ जीवित रहते हैं और अब इतिहास
          को दोहराने और दुनिया को हमारे लिए एक बेहतर जगह में बदलने का समय
          है। आखिरकार, प्रगति वास्तविक और उपयोगी है जब हम सभी एक ही समय
          में आगे बढ़ते हैं।"
          link2="/page"
          img2={Social}
          link2a="/page"
          head2="सामाजिक मूल्यांकन"
          contant2=" दो तिहाई लोगों का मानना ​​है कि महिलाएं अपने देश में तब तक समानता
          हासिल नहीं करेंगी जब तक पुरुष महिलाओं के अधिकारों का समर्थन करने
          के लिए कार्रवाई नहीं करेंगे। हालांकि, राय इस बात पर विभाजित है कि
          क्या समानता की लड़ाई में मदद के लिए पुरुषों से बहुत अधिक उम्मीद की
          जा रही है।"
        />
      </div>
    );
  }
}

export default Homexx;
